# Клітини на шахівниці ідентифікуються буквою і цифрою. Літера визначає положення клітини
# по горизонталі, а цифра – по вертикалі.
# Ваша програма повинна вимагати у користувача координати клітини.
# Використовуйте умовний вираз для визначення того, з якої клітини – білої чи
# чорної – починається стовпець. Потім, за допомогою звичайної арифметики, необхідно визначити
# колір конкретної клітини. Наприклад, якщо користувач ввів a1, програма має визначити, що клітина
# із цими координатами чорна. Якщо d5 – біла. Перевірку на хибність
# введення координат клітини виконувати не потрібно.

coordinate_string = input('Enter the coordinates of the checkerboard:')

# Координату У переводим в целое число
coordinate_y = int(coordinate_string[1])

# Присвоение координате Х числового значения
a = 'abcdefg'
b = (1, 2, 3, 4, 5, 6, 7, 8)
coordinates_x = dict(zip(a, b))
# coordinates_x = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5, 'f': 6, 'g': 7, 'h': 8}
coordinate_x = coordinate_string[0]
coordinate_x = coordinates_x[coordinate_x]

# Проверка черная или белая клетка и вывод результата
if (coordinate_x + coordinate_y) % 2 == 0:
    print('This cell', coordinate_string[0:2], 'is black')
elif (coordinate_x + coordinate_y) % 2 == 1:
    print('This cell', coordinate_string[0:2], 'is while')